#include "INF_HELP.h";
#include <string>;

void DataString::setData()
{
	Data = "Інформація про функції програми\n\nПошук - користувач вводе номер маршруту, який хоче відобразити";
	Data += "на карті. Після натискання кнопки <Вибрати>, програма сховає усі маршрути крім шуканого.\n\n";
	Data += "Маршрути - користувач має змогу отримати інформацію про всі маршрути, що були задіяні у програмі.\n\n";
	Data += "Відобразити - оновлює поточне місцеположення усіх маршрутів\n\n";
	Data += "Інформація - дозволяє користувачу знайти повну інформацію про вказаний ним маршрутю.\n\n";
	Data += "? - Відображає інформацію про авторів програми та функції програми\n\n";

}
std::string DataString::GetData() 
{ return Data; }

std::string DataString::Information()
{
	setData();
	return GetData();
}
